Repository: caresoft-ricent/Flutterai
Catalog: lib/l10n/app_*.arb
Languages: ar, zh, zh_hant

# cameraCaptureTitle
source: Take photo
ar: التقاط صورة
zh: 拍照
zh_hant: 拍照

# cameraCaptureUnavailable
source: Camera unavailable
ar: الكاميرا غير متاحة
zh: 相机不可用
zh_hant: 相機不可用

# cameraCaptureNoCamera
source: No camera detected
ar: لم يتم اكتشاف كاميرا
zh: 未检测到可用相机
zh_hant: 未偵測到可用相機

# cameraCaptureInitFailed
source: Failed to initialize camera: {error}
ar: فشل تهيئة الكاميرا: {error}
zh: 相机初始化失败：{error}
zh_hant: 相機初始化失敗：{error}

# cameraCaptureTakeFailedRetry
source: Failed to take photo. Please try again.
ar: فشل التقاط الصورة. يرجى المحاولة مرة أخرى.
zh: 拍照失败，请重试
zh_hant: 拍照失敗，請重試

# commonRealtimeRecognition
source: Live: {partial}
ar: مباشر: {partial}
zh: 实时识别：{partial}
zh_hant: 即時辨識：{partial}

# commonLastRecognition
source: Last: {text}
ar: آخر: {text}
zh: 上次识别：{text}
zh_hant: 上次辨識：{text}

# commonCurrentLocation
source: Current location
ar: الموقع الحالي
zh: 当前位置
zh_hant: 目前位置

# commonUnknownLocation
source: Unknown location
ar: موقع غير معروف
zh: 未知位置
zh_hant: 未知位置

# commonLocation
source: Location
ar: الموقع
zh: 位置
zh_hant: 位置

# commonPart
source: Area
ar: الموضع
zh: 部位
zh_hant: 部位

# commonDivision
source: Division
ar: القسم
zh: 分部
zh_hant: 分部

# commonSubdivision
source: Subdivision
ar: القسم الفرعي
zh: 子分部
zh_hant: 子分部

# commonItem
source: Item
ar: البند
zh: 分项
zh_hant: 分項

# commonIndicator
source: Indicator
ar: المؤشر
zh: 指标
zh_hant: 指標

# commonAgreeAndFill
source: Agree & fill
ar: موافقة وتعبئة
zh: 同意并填充
zh_hant: 同意並填充

# commonDisagree
source: Disagree
ar: عدم الموافقة
zh: 不同意
zh_hant: 不同意

# commonRecognitionResultConfirmTitle
source: Confirm recognition result
ar: تأكيد نتيجة التعرف
zh: 识别结果确认
zh_hant: 辨識結果確認

# commonYouJustSaid
source: You just said:
ar: قلت للتو:
zh: 你刚才说：
zh_hant: 你剛才說：

# commonRetrySpeak
source: Speak again
ar: أعد الكلام
zh: 重说
zh_hant: 重說

# commonUseAndFill
source: Use & fill
ar: استخدم واملأ
zh: 使用并回填
zh_hant: 使用並回填

# commonSnackNoValidVoiceRetry
source: No valid speech detected. Please try again.
ar: لم يتم اكتشاف كلام صالح. يرجى المحاولة مرة أخرى.
zh: 未识别到有效语音内容，请重试
zh_hant: 未辨識到有效語音內容，請重試

# commonSubmitFailedBackendUnavailable
source: Submit failed: backend unavailable
ar: فشل الإرسال: الخادم غير متاح
zh: 提交失败：后端不可用
zh_hant: 提交失敗：後端不可用

# commonSubmittedToBackend
source: Submitted to backend: {id}
ar: تم الإرسال إلى الخادم: {id}
zh: 已提交到后端：{id}
zh_hant: 已提交到後端：{id}

# commonAiAnalyzing
source: Analyzing…
ar: جارٍ التحليل…
zh: AI分析中…
zh_hant: AI分析中…

# commonLineNote
source: Note: {text}
ar: ملاحظة: {text}
zh: 说明：{text}
zh_hant: 說明：{text}

# issueSeverityNormal
source: Normal
ar: عادي
zh: 一般
zh_hant: 一般

# issueSeveritySevere
source: Severe
ar: شديد
zh: 严重
zh_hant: 嚴重

# dailyInspectionTitle
source: Daily inspection
ar: تفتيش يومي
zh: 日常巡检
zh_hant: 日常巡檢

# dailyInspectionPromptTitle
source: Daily inspection
ar: تفتيش يومي
zh: 日常巡检
zh_hant: 日常巡檢

# dailyInspectionBackendConnected
source: Backend connected (can submit to DB)
ar: الخادم متصل (يمكن الإرسال إلى قاعدة البيانات)
zh: 后端已连接（可提交到数据库）
zh_hant: 後端已連線（可提交到資料庫）

# dailyInspectionBackendDisconnected
source: Backend disconnected (draft only; submit will fail)
ar: الخادم غير متصل (مسودة فقط؛ الإرسال سيفشل)
zh: 后端未连接（当前只能暂存/提交会失败）
zh_hant: 後端未連線（目前只能暫存/提交會失敗）

# dailyInspectionLabelSeverity
source: Severity
ar: درجة الخطورة
zh: 问题级别
zh_hant: 問題級別

# dailyInspectionLabelDeadlineDays
source: Rectify deadline (days)
ar: مهلة المعالجة (أيام)
zh: 整改时限（天）
zh_hant: 整改時限（天）

# dailyInspectionLabelUnit
source: Responsible unit
ar: الجهة المسؤولة
zh: 责任单位
zh_hant: 責任單位

# dailyInspectionLabelOwner
source: Owner
ar: المسؤول
zh: 责任人
zh_hant: 責任人

# dailyInspectionListening
source: Listening… (live recognition)
ar: جارٍ الاستماع… (تعرف مباشر)
zh: 正在聆听…（实时识别中）
zh_hant: 正在聆聽…（即時辨識中）

# dailyInspectionTapStop
source: Tap to stop
ar: اضغط للإيقاف
zh: 点击停止
zh_hant: 點擊停止

# dailyInspectionVoiceToTextStart
source: Voice to text
ar: تحويل الصوت إلى نص
zh: 语音转文字
zh_hant: 語音轉文字

# dailyInspectionVoiceToTextStop
source: Stop
ar: إيقاف
zh: 停止
zh_hant: 停止

# dailyInspectionDescriptionLabel
source: Description
ar: الوصف
zh: 问题描述
zh_hant: 問題描述

# dailyInspectionOnsitePhoto
source: On-site photo
ar: صورة من الموقع
zh: 现场照片
zh_hant: 現場照片

# dailyInspectionPhotoTapHint
source: Tap to take a photo
ar: اضغط لالتقاط صورة
zh: 点击拍照
zh_hant: 點擊拍照

# dailyInspectionPhotoHasPhotoHint
source: Tap to retake, or tap × to clear
ar: اضغط لإعادة الالتقاط، أو اضغط × للمسح
zh: 点击可重拍，点右上角 × 清除
zh_hant: 點擊可重拍，點右上角 × 清除

# dailyInspectionSnackWebVoiceNotSupported
source: Voice recognition is not supported on web. Please use a device.
ar: التعرف على الصوت غير مدعوم على الويب. يرجى استخدام جهاز.
zh: Web 端暂不支持语音识别，请用真机。
zh_hant: Web 端暫不支援語音辨識，請用真機。

# dailyInspectionSnackWebCameraNotSupported
source: Web is preview-only. Camera/recognition are not supported.
ar: الويب للمعاينة فقط. الكاميرا/التعرف غير مدعومين.
zh: Web 端仅用于预览 UI，暂不支持拍照/识别。
zh_hant: Web 端僅用於預覽 UI，暫不支援拍照/辨識。

# dailyInspectionSnackPhotoCanceled
source: Photo canceled
ar: تم إلغاء التقاط الصورة
zh: 已取消拍照
zh_hant: 已取消拍照

# dailyInspectionUnitProjectDept
source: Project department
ar: قسم المشروع
zh: 项目部
zh_hant: 專案部

# dailyInspectionUnitAnhuiConstruction
source: Anhui construction
ar: إنشاءات آنهوي
zh: 安徽施工
zh_hant: 安徽施工

# dailyInspectionOwnerMuYi
source: Mu Yi
ar: مو يي
zh: 木易
zh_hant: 木易

# dailyInspectionOwnerFengConstruction
source: Feng (construction)
ar: فينغ (إنشاءات)
zh: 冯施工
zh_hant: 馮施工

# dailyInspectionTtsMatchedStartAcceptance
source: Matched {region} / {library}. Starting the acceptance guide.
ar: تمت مطابقة {region} / {library}. جارٍ بدء دليل القبول.
zh: 已为您匹配到{region} 的 {library}，开始验收引导。
zh_hant: 已為您匹配到{region} 的 {library}，開始驗收引導。

# dailyInspectionTtsPrefilledDescriptionContinue
source: Category prefilled based on your description. You can still edit.
ar: تمت تعبئة التصنيف بناءً على وصفك. يمكنك التعديل.
zh: 已根据你的描述回填分类，可继续修改。
zh_hant: 已根據你的描述回填分類，可繼續修改。

# dailyInspectionTtsEnteredContinue
source: Description filled. You can select category manually.
ar: تمت تعبئة الوصف. يمكنك اختيار التصنيف يدويًا.
zh: 已填入描述，可手动选择分类。
zh_hant: 已填入描述，可手動選擇分類。

# dailyInspectionTtsCannotUnderstandTryExample
source: Sorry, I couldn't understand. Try: Building 3, Floor 4: rebar cover is insufficient.
ar: عذرًا، لم أفهم. جرّب: المبنى 3، الطابق 4: غطاء التسليح غير كافٍ.
zh: 暂时无法理解您的指令，请尝试说：3栋4层发现钢筋保护层不足。
zh_hant: 暫時無法理解您的指令，請嘗試說：3棟4層發現鋼筋保護層不足。

# dailyInspectionVoiceDescribe
source: Voice refine
ar: تصحيح بالصوت
zh: 语音补充
zh_hant: 語音補充

# dailyInspectionTtsDescribeIssuePrompt
source: Please describe the issue you found.
ar: يرجى وصف المشكلة التي وجدتها.
zh: 请描述你发现的问题。
zh_hant: 請描述你發現的問題。

# dailyInspectionSnackSelectCategoryFirst
source: Please select division/subdivision/item/indicator first
ar: يرجى اختيار القسم/القسم الفرعي/البند/المؤشر أولاً
zh: 请先选择分部/子分部/分项/指标
zh_hant: 請先選擇分部/子分部/分項/指標

# dailyInspectionSnackPleaseFillDescription
source: Please fill in the description
ar: يرجى إدخال الوصف
zh: 请填写问题描述
zh_hant: 請填寫問題描述

# dailyInspectionSnackPrefilledCategoryMatched
source: Category prefilled from your description. You can still edit.
ar: تمت تعبئة التصنيف من وصفك. يمكنك التعديل.
zh: 已根据你的描述回填分类，可继续修改。
zh_hant: 已根據你的描述回填分類，可繼續修改。

# dailyInspectionSnackDescriptionFilledManualSelect
source: Description filled. Please select the category manually.
ar: تمت تعبئة الوصف. يرجى اختيار التصنيف يدويًا.
zh: 已填入描述，可手动选择分类。
zh_hant: 已填入描述，可手動選擇分類。

# dailyInspectionSnackLocalMatchFailedManual
source: Description filled, but local matching failed. Please select manually.
ar: تمت تعبئة الوصف، لكن فشل التطابق المحلي. اختر يدويًا.
zh: 已填入描述，但本地分类匹配失败，请手动选择。
zh_hant: 已填入描述，但本機分類匹配失敗，請手動選擇。

# dailyInspectionSnackPrefilledFromVoiceMatched
source: Matched and prefilled from voice. You can still edit.
ar: تمت المطابقة والتعبئة من الصوت. يمكنك التعديل.
zh: 已根据语音描述匹配并回填，可继续修改。
zh_hant: 已根據語音描述匹配並回填，可繼續修改。

# dailyInspectionSnackPrefilledFromVoiceManualSelect
source: Voice description filled. Please select the category manually.
ar: تمت تعبئة وصف الصوت. اختر التصنيف يدويًا.
zh: 已回填语音描述，可手动选择分类。
zh_hant: 已回填語音描述，可手動選擇分類。

# dailyInspectionSnackPrefillFromVoiceFailed
source: Failed to prefill from voice: {error}
ar: فشل التعبئة من الصوت: {error}
zh: 根据语音回填失败：{error}
zh_hant: 根據語音回填失敗：{error}

# dailyInspectionTtsPhotoDoneMatchingLibrary
source: Photo captured. Matching the issue library based on what you said.
ar: تم التقاط الصورة. جارٍ مطابقة مكتبة العيوب بناءً على ما قلت.
zh: 拍照完成，正在根据你说的问题匹配问题库。
zh_hant: 拍照完成，正在根據你說的問題匹配問題庫。

# dailyInspectionTtsPhotoDoneStartAnalyze
source: Photo captured. Starting analysis.
ar: تم التقاط الصورة. جارٍ بدء التحليل.
zh: 拍照完成，开始识别。
zh_hant: 拍照完成，開始辨識。

# dailyInspectionSceneHintPhoto
source: Daily inspection photo (could be a defect photo, or a tag/delivery note)
ar: صورة تفتيش يومي (قد تكون صورة عيب أو بطاقة/مستند توريد)
zh: 日常巡检拍照（可能是缺陷照片，也可能是铭牌/送货单）
zh_hant: 日常巡檢拍照（可能是缺陷照片，也可能是銘牌/送貨單）

# dailyInspectionPhotoHint
source: Prefer matching a concrete indicator from the defect library; otherwise output a short recordable description.
ar: فضّل مطابقة مؤشر محدد من مكتبة العيوب؛ وإلا فقدم وصفًا قصيرًا قابلاً للتسجيل.
zh: 优先从问题库匹配具体指标；若不匹配则给出简短可记录描述。
zh_hant: 優先從問題庫匹配具體指標；若不匹配則給出簡短可記錄描述。

# dailyInspectionLineDefectType
source: Defect type: {text}
ar: نوع العيب: {text}
zh: 缺陷类型：{text}
zh_hant: 缺陷類型：{text}

# dailyInspectionLineSeverity
source: Severity: {text}
ar: درجة الخطورة: {text}
zh: 严重程度：{text}
zh_hant: 嚴重程度：{text}

# dailyInspectionLineRectify
source: Rectify: {text}
ar: المعالجة: {text}
zh: 整改：{text}
zh_hant: 整改：{text}

# dailyInspectionTtsRecognizedPleaseConfirm
source: Recognition done. Please confirm.
ar: اكتمل التعرف. يرجى التأكيد.
zh: 识别完成，请确认。
zh_hant: 辨識完成，請確認。

# dailyInspectionAiWillFillLabel
source: Will fill
ar: سيتم التعبئة
zh: 将填充
zh_hant: 將填充

# dailyInspectionAiLabelEntryId
source: Entry ID
ar: معرّف البند
zh: 条目ID
zh_hant: 條目ID

# dailyInspectionAiLabelLevel
source: Level
ar: المستوى
zh: 级别
zh_hant: 級別

# dailyInspectionAiLabelDeadlineDays
source: Deadline
ar: المهلة
zh: 整改天数
zh_hant: 整改天數

# dailyInspectionAiLabelCategory
source: Category
ar: التصنيف
zh: 分类
zh_hant: 分類

# dailyInspectionAiCategoryNotMatchedHint
source: No library entry matched (you may skip filling and select manually)
ar: لم تتم مطابقة بند في المكتبة (يمكنك تخطي التعبئة والاختيار يدويًا)
zh: 未命中问题库条目（可选择不填充，改为手动选择）
zh_hant: 未命中問題庫條目（可選擇不填充，改為手動選擇）

# dailyInspectionAiLabelType
source: Type
ar: النوع
zh: 类型
zh_hant: 類型

# dailyInspectionAiLabelSummary
source: Summary
ar: الملخص
zh: 说明
zh_hant: 說明

# dailyInspectionAiLabelDefectType
source: Defect type
ar: نوع العيب
zh: 缺陷类型
zh_hant: 缺陷類型

# dailyInspectionAiLabelSeverity
source: Severity
ar: درجة الخطورة
zh: 严重程度
zh_hant: 嚴重程度

# dailyInspectionAiLabelRectifySuggestion
source: Rectify suggestion
ar: اقتراح المعالجة
zh: 整改建议
zh_hant: 整改建議

# dailyInspectionAiWillFillDescLabel
source: Will fill description:
ar: سيتم تعبئة الوصف:
zh: 将填入问题描述：
zh_hant: 將填入問題描述：

# dailyInspectionSnackAiAnalyzeFailed
source: AI analysis failed: {error}
ar: فشل تحليل AI: {error}
zh: AI识别失败：{error}
zh_hant: AI辨識失敗：{error}

# acceptanceTitle
source: Acceptance
ar: القبول
zh: 工序验收
zh_hant: 工序驗收

# acceptanceUnnamedIndicator
source: Unnamed indicator
ar: مؤشر بلا اسم
zh: 未命名指标
zh_hant: 未命名指標

# acceptanceResultSkipped
source: Skipped
ar: تم التخطي
zh: 跳过
zh_hant: 跳過

# acceptanceOverallPending
source: Pending
ar: قيد الانتظار
zh: 待完成
zh_hant: 待完成

# acceptanceNoLibrarySelected
source: No library selected
ar: لم يتم اختيار مكتبة
zh: 未选择体系
zh_hant: 未選擇體系

# acceptanceNoTargets
source: No indicators found
ar: لا توجد مؤشرات
zh: 未找到指标
zh_hant: 未找到指標

# acceptanceDemoProjectTitle
source: Demo project
ar: مشروع تجريبي
zh: 演示项目
zh_hant: 示範專案

# acceptanceConfirmAll
source: Confirm all
ar: تأكيد الكل
zh: 全部确认
zh_hant: 全部確認

# acceptanceViewDrawing
source: View drawing
ar: عرض المخطط
zh: 查看图纸
zh_hant: 查看圖紙

# acceptanceSnackViewDrawingPlaceholder
source: Drawing view is not integrated yet
ar: عرض المخطط غير مدمج بعد
zh: 图纸查看功能待接入
zh_hant: 圖紙查看功能待接入

# acceptanceTooltipExpandInfo
source: Expand info
ar: توسيع المعلومات
zh: 展开信息
zh_hant: 展開資訊

# acceptanceTooltipCollapseInfo
source: Collapse info
ar: طيّ المعلومات
zh: 收起信息
zh_hant: 收起資訊

# acceptanceHintSelectOrLongPressMic
source: Select an item or long-press the mic
ar: اختر عنصرًا أو اضغط مطولاً على الميكروفون
zh: 请选择或长按麦克风说话
zh_hant: 請選擇或長按麥克風說話

# acceptanceSectionPrimaryControls
source: Primary controls
ar: عناصر التحكم الأساسية
zh: 主控项
zh_hant: 主控項

# acceptanceTtsItemPrompt
source: Item {index}: {content}
ar: البند {index}: {content}
zh: 第{index}项：{content}
zh_hant: 第{index}項：{content}

# acceptanceTtsAllAnsweredYouCanSubmit
source: All items are completed. You can submit.
ar: تم إكمال جميع البنود. يمكنك الإرسال.
zh: 已完成全部项目，可以提交。
zh_hant: 已完成全部項目，可以提交。

# acceptanceTtsMatchedStartAcceptance
source: Matched {region} / {library}. Starting the acceptance guide.
ar: تمت مطابقة {region} / {library}. جارٍ بدء دليل القبول.
zh: 已为您匹配到{region} 的 {library}，开始验收引导。
zh_hant: 已為您匹配到{region} 的 {library}，開始驗收引導。

# acceptanceTtsNotRecognizedTryExample
source: Sorry, I couldn't understand. Try: I want to accept rebar on Building 1, Floor 6.
ar: عذرًا، لم أفهم. جرّب: أريد قبول حديد التسليح في المبنى 1، الطابق 6.
zh: 暂时无法理解您的指令，请尝试说：我要验收1栋6层的钢筋。
zh_hant: 暫時無法理解您的指令，請嘗試說：我要驗收1棟6層的鋼筋。

# acceptanceTtsStartAcceptance
source: Starting {library}. Total {count} items.
ar: بدء {library}. الإجمالي {count} بند.
zh: 开始{library}验收，共{count}项。
zh_hant: 開始{library}驗收，共{count}項。

# acceptanceTtsNoTargetsChangeLibrary
source: No indicators found. Please switch the library and try again.
ar: لا توجد مؤشرات. يرجى تغيير المكتبة والمحاولة مرة أخرى.
zh: 未找到指标，请更换体系重试。
zh_hant: 未找到指標，請更換體系重試。

# acceptanceTtsSelectedPleaseTakePhoto
source: Selected {target}. Please take a photo.
ar: تم اختيار {target}. يرجى التقاط صورة.
zh: 已选择{target}，请拍照。
zh_hant: 已選擇{target}，請拍照。

# acceptanceTtsSelected
source: Selected {target}.
ar: تم اختيار {target}.
zh: 已选择{target}。
zh_hant: 已選擇{target}。

# acceptanceTtsCompleteAllBeforeSubmit
source: Please complete all items before submitting.
ar: يرجى إكمال جميع البنود قبل الإرسال.
zh: 请先完成全部项目再提交。
zh_hant: 請先完成全部項目再提交。

# acceptanceSnackCompleteAllBeforeSubmit
source: Please complete all items before submitting
ar: يرجى إكمال جميع البنود قبل الإرسال
zh: 请先完成全部项目再提交
zh_hant: 請先完成全部項目再提交

# acceptanceTtsCompletedSavedWillSync
source: Completed and saved. You can sync later.
ar: تم الإكمال والحفظ. يمكنك المزامنة لاحقًا.
zh: 已完成并保存，稍后可同步。
zh_hant: 已完成並儲存，稍後可同步。

# acceptanceSceneHintPhoto
source: Acceptance photo
ar: صورة القبول
zh: 工序验收拍照
zh_hant: 工序驗收拍照

# acceptancePhotoHintRemark
source: Add a one-sentence conclusion.
ar: أضف خلاصة بجملة واحدة.
zh: 请用一句话说明验收结论。
zh_hant: 請用一句話說明驗收結論。

# acceptancePhotoHintIfIrrelevant
source: If irrelevant to the indicator, mention it in the note.
ar: إذا لم يكن مرتبطًا بالمؤشر، اذكر ذلك في الملاحظة.
zh: 如与当前指标无关，可在说明中写明。
zh_hant: 如與目前指標無關，可在說明中寫明。

# acceptanceBatchTitle
source: Batch {batch} - {region}
ar: الدفعة {batch} - {region}
zh: 第{batch}批 - {region}
zh_hant: 第{batch}批 - {region}

# acceptanceTtsConfirmedAllQualified
source: All confirmed as qualified.
ar: تم تأكيد أن جميع البنود مقبولة.
zh: 已确认全部合格。
zh_hant: 已確認全部合格。

# acceptanceUnqualifiedCount
source: Unqualified: {count}
ar: غير مقبول: {count}
zh: 不合格：{count}
zh_hant: 不合格：{count}

# acceptanceOverallResult
source: Overall: {result}
ar: النتيجة الإجمالية: {result}
zh: 总体结果：{result}
zh_hant: 總體結果：{result}

# commonSeverityHigh
source: High
ar: مرتفع
zh: 高
zh_hant: 高

# commonSeverityMedium
source: Medium
ar: متوسط
zh: 中
zh_hant: 中

# commonSeverityLow
source: Low
ar: منخفض
zh: 低
zh_hant: 低

# commonNotProvided
source: Not provided
ar: غير متوفر
zh: 未提供
zh_hant: 未提供

# commonCannotDetermineRetry
source: Cannot determine. Please retry.
ar: لا يمكن التحديد. يرجى إعادة المحاولة.
zh: 无法判断，请重试。
zh_hant: 無法判斷，請重試。

# commonExpand
source: Expand
ar: توسيع
zh: 展开
zh_hant: 展開

# commonCollapse
source: Collapse
ar: طي
zh: 收起
zh_hant: 收起

# acceptanceAiHintTakeConstructionPhoto
source: Please take a clear photo of the construction process or component details.
ar: يرجى التقاط صورة واضحة لعملية البناء أو تفاصيل المكوّن.
zh: 请拍摄施工过程或构件细节的清晰照片。
zh_hant: 請拍攝施工過程或構件細節的清晰照片。

# acceptanceAiFoundIssue
source: Issue found
ar: تم العثور على مشكلة
zh: 发现问题
zh_hant: 發現問題

# acceptanceAiDefectTypeLine
source: Defect type: {text}
ar: نوع العيب: {text}
zh: 缺陷类型：{text}
zh_hant: 缺陷類型：{text}

# acceptanceAiSeverityLine
source: Severity: {text}
ar: درجة الخطورة: {text}
zh: 严重程度：{text}
zh_hant: 嚴重程度：{text}

# acceptanceAiRectifySuggestionLine
source: Rectify suggestion: {text}
ar: اقتراح المعالجة: {text}
zh: 整改建议：{text}
zh_hant: 整改建議：{text}

# acceptanceAiMatchedHistory
source: Matched historical issues
ar: تمت مطابقة مشكلات سابقة
zh: 与历史问题匹配
zh_hant: 與歷史問題匹配

# languageEn
source: English
ar: الإنجليزية

# recordsFieldId
source: ID
ar: المعرّف
