Repository: caresoft-ricent/Flutterai
Catalog: lib/l10n/app_*.arb
Languages: ar, zh, zh_hant

# appTitle
source: Beaver Cloud AI
ar: بيفر كلاود AI
zh: 河狸云AI
zh_hant: 河狸雲AI

# homeTitle
source: Beaver Cloud AI - Demo
ar: بيفر كلاود AI - نسخة تجريبية
zh: 河狸云AI - Demo
zh_hant: 河狸雲AI - Demo

# settingsTitle
source: Settings
ar: الإعدادات
zh: 设置
zh_hant: 設定

# languageTitle
source: Language
ar: اللغة
zh: 语言
zh_hant: 語言

# languageSystem
source: System default
ar: لغة النظام
zh: 跟随系统
zh_hant: 跟隨系統

# languageZhHans
source: Simplified Chinese
ar: الصينية المبسطة
zh: 简体中文
zh_hant: 簡體中文

# languageZhHant
source: Traditional Chinese
ar: الصينية التقليدية
zh: 繁體中文
zh_hant: 繁體中文

# languageAr
source: Arabic
ar: العربية
zh: العربية
zh_hant: العربية

# backendSettingsTitle
source: Backend Settings
ar: إعدادات الخادم
zh: 后端设置
zh_hant: 後端設定

# backendSaved
source: Backend URL saved
ar: تم حفظ عنوان الخادم
zh: 后端地址已保存
zh_hant: 後端位址已儲存

# backendReset
source: Reset
ar: إعادة الضبط
zh: 恢复默认
zh_hant: 恢復預設

# backendResetDone
source: Restored default backend URL
ar: تمت استعادة العنوان الافتراضي للخادم
zh: 已恢复默认后端地址
zh_hant: 已恢復預設後端位址

# backendCurrentEffective
source: Effective: {url}
ar: العنوان الفعّال: {url}
zh: 当前生效：{url}
zh_hant: 目前生效：{url}

# backendBaseUrlLabel
source: Backend API Base URL (leave empty to use default)
ar: عنوان API الأساسي للخادم (اتركه فارغاً لاستخدام الافتراضي)
zh: 后端 API Base URL（可留空使用默认）
zh_hant: 後端 API Base URL（可留空使用預設）

# backendSave
source: Save
ar: حفظ
zh: 保存
zh_hant: 儲存

# backendSaving
source: Saving…
ar: جارٍ الحفظ…
zh: 保存中…
zh_hant: 儲存中…

# backendConnectivityCheck
source: Connectivity: {status}
ar: الاتصال: {status}
zh: 连通性检测：{status}
zh_hant: 連通性檢測：{status}

# backendStatusUnknown
source: Not checked
ar: غير مُتحقق
zh: 未检测
zh_hant: 未檢測

# backendStatusConnected
source: Connected
ar: متصل
zh: 已连接
zh_hant: 已連線

# backendStatusDisconnected
source: Disconnected
ar: غير متصل
zh: 未连接
zh_hant: 未連線

# backendTipLan
source: Tip: for on-device debugging, use your Mac LAN IP, e.g. http://192.168.x.x:8000
ar: ملاحظة: عند الاختبار على الجهاز الحقيقي، استخدم عنوان IP المحلي للـ Mac، مثل http://192.168.x.x:8000
zh: 提示：真机联调时通常需要填写 Mac 的局域网 IP，例如 http://192.168.x.x:8000
zh_hant: 提示：真機聯調時通常需要填寫 Mac 的區域網 IP，例如 http://192.168.x.x:8000

# backendAiEnabledTitle
source: Enable LLM (AI Chat)
ar: تفعيل نموذج اللغة (دردشة AI)
zh_hant: 啟用大模型（AI 問答）

# backendAiEnabledSubtitle
source: On = try Doubao and rewrite; Off = rules-only (for demo comparison)
ar: تشغيل = محاولة Doubao وإعادة الصياغة؛ إيقاف = قواعد فقط (للعرض)
zh_hant: 開=嘗試呼叫豆包並潤色回答；關=只回傳規則答案（用於演示對比）

# backendAiEnabledOn
source: LLM enabled (device)
ar: تم تفعيل النموذج (الجهاز)
zh_hant: 大模型已開啟（本機）

# backendAiEnabledOff
source: LLM disabled (device)
ar: تم تعطيل النموذج (الجهاز)
zh_hant: 大模型已關閉（本機）

# navRecords
source: Records
ar: السجلات
zh: 记录表
zh_hant: 記錄表

# navBackendSettings
source: Backend
ar: الخادم
zh: 后端设置
zh_hant: 後端設定

# navSettings
source: Settings
ar: الإعدادات
zh: 设置
zh_hant: 設定

# tooltipRefresh
source: Refresh
ar: تحديث
zh: 刷新
zh_hant: 重新整理

# tabAcceptance
source: Acceptance
ar: القبول
zh: 验收
zh_hant: 驗收

# tabInspection
source: Inspection
ar: التفتيش
zh: 巡检
zh_hant: 巡檢

# commonLoading
source: Loading…
ar: جارٍ التحميل…
zh: 加载中…
zh_hant: 載入中…

# commonLoadFailed
source: Load failed: {error}
ar: فشل التحميل: {error}
zh: 加载失败：{error}
zh_hant: 載入失敗：{error}

# commonOK
source: OK
ar: موافق
zh: 确定
zh_hant: 確定

# commonCancel
source: Cancel
ar: إلغاء
zh: 取消
zh_hant: 取消

# commonCopy
source: Copy
ar: نسخ
zh: 复制
zh_hant: 複製

# commonCopiedToClipboard
source: Copied to clipboard
ar: تم النسخ إلى الحافظة
zh: 已复制到剪贴板
zh_hant: 已複製到剪貼簿

# commonDelete
source: Delete
ar: حذف
zh: 删除
zh_hant: 刪除

# homeStatusTapMicToStart
source: Tap the mic below to start speaking
ar: اضغط على الميكروفون بالأسفل لبدء التحدث
zh: 点击下方麦克风开始说话
zh_hant: 點擊下方麥克風開始說話

# homeDownloadGemmaTitle
source: Download Gemma multimodal model (~3GB)
zh: 下载Gemma多模态模型(~3GB)
zh_hant: 下載Gemma多模態模型(~3GB)

# homeDownloadGemmaBody
source: First-time use requires downloading the offline multimodal model (HuggingFace access approval required).
zh: 首次启用需要下载离线多模态模型（需要HuggingFace访问授权）。
zh_hant: 首次啟用需要下載離線多模態模型（需要HuggingFace存取授權）。

# homeDownloadSpeechTitle
source: Download speech model (~300MB)
ar: تنزيل نموذج الصوت (~300MB)
zh: 下载语音模型(~300MB)
zh_hant: 下載語音模型(~300MB)

# homeDownloadSpeechBody
source: First run requires downloading the offline speech model. Please keep the network connected.
ar: يتطلب التشغيل لأول مرة تنزيل نموذج التعرف على الصوت دون اتصال. يرجى إبقاء الشبكة متصلة.
zh: 首次运行需要下载离线语音模型，请保持网络。
zh_hant: 首次執行需要下載離線語音模型，請保持網路。

# homeProgressLabel
source: Progress: {pct}%
ar: التقدم: {pct}%
zh: 进度：{pct}%
zh_hant: 進度：{pct}%

# homeStatusConnectingOnlineAsr
source: Connecting to online speech recognition…
ar: جارٍ الاتصال بالتعرف على الكلام عبر الإنترنت…
zh: 正在连接在线语音识别…
zh_hant: 正在連線線上語音辨識…

# homeStatusListeningSpeakCommand
source: Listening. Please say an acceptance command…
ar: جارٍ الاستماع. الرجاء قول أمر القبول…
zh: 正在监听，请说出验收指令…
zh_hant: 正在聆聽，請說出驗收指令…

# homeStatusSpeaking
source: Speaking: {partial}
ar: تتحدث: {partial}
zh: 正在说：{partial}
zh_hant: 正在說：{partial}

# homeStatusOnlineUnavailableFallback
source: Online recognition unavailable; falling back to offline. Please check network / Xunfei config / mic permission.
ar: التعرف عبر الإنترنت غير متاح؛ جارٍ الرجوع إلى دون اتصال. تحقق من الشبكة / إعدادات Xunfei / إذن الميكروفون.
zh: 在线识别不可用，已回落离线：请检查网络/讯飞配置/麦克风权限
zh_hant: 線上辨識不可用，已回落離線：請檢查網路/訊飛設定/麥克風權限

# homeStatusAsrNotReady
source: Speech recognition is not ready: please grant microphone permission and finish downloading the model
ar: التعرف على الكلام غير جاهز: يرجى منح إذن الميكروفون وإكمال تنزيل النموذج
zh: 语音识别未就绪：请允许麦克风权限，并完成模型下载
zh_hant: 語音辨識未就緒：請允許麥克風權限，並完成模型下載

# homeStatusSpeechModelNotReadyDownloadFirst
source: Speech model not ready: please finish downloading the model first
ar: نموذج الصوت غير جاهز: يرجى إكمال تنزيل النموذج أولاً
zh: 语音模型未就绪：请先完成模型下载
zh_hant: 語音模型未就緒：請先完成模型下載

# homeStatusSpeechModelNotReadyWithError
source: Speech model not ready: {error}
ar: نموذج الصوت غير جاهز: {error}
zh: 语音模型未就绪：{error}
zh_hant: 語音模型未就緒：{error}

# homeSnackModelInitFailed
source: Model initialization failed: {error}
ar: فشل تهيئة النموذج: {error}
zh: 模型初始化失败：{error}
zh_hant: 模型初始化失敗：{error}

# homeStatusStoppedListening
source: Stopped listening
ar: تم إيقاف الاستماع
zh: 已停止监听
zh_hant: 已停止聆聽

# homeStatusIntentParsing
source: Recognition finished. Parsing intent…
ar: اكتمل التعرف. جارٍ تحليل النية…
zh: 识别完成，正在解析意图…
zh_hant: 辨識完成，正在解析意圖…

# homeTtsMatchedStartAcceptance
source: Matched {region} / {library}. Starting the acceptance guide.
ar: تمت مطابقة {region} / {library}. جارٍ بدء دليل القبول.
zh: 已为您匹配到{region} 的 {library}，开始验收引导。
zh_hant: 已為您匹配到{region} 的 {library}，開始驗收引導。

# homeTtsNotMatchedRetry
source: Could not match the item or location. Please try again.
ar: تعذر مطابقة البند أو الموقع. يرجى المحاولة مرة أخرى.
zh: 未能匹配到分项或位置，请重试。
zh_hant: 未能匹配到分項或位置，請重試。

# homeStatusNotMatchedRetry
source: Item or location not matched. Please try again
ar: تعذر مطابقة البند أو الموقع. حاول مرة أخرى
zh: 未匹配到分项或位置，请重试
zh_hant: 未匹配到分項或位置，請重試

# homeTtsEnteringIssueReport
source: Issue reporting intent detected. Opening the issue report page.
ar: تم اكتشاف نية الإبلاغ عن مشكلة. جارٍ فتح صفحة الإبلاغ.
zh: 检测到问题上报意图，进入问题上报页面。
zh_hant: 偵測到問題上報意圖，進入問題上報頁面。

# homeTtsCannotUnderstandTryExample
source: Sorry, I couldn't understand. Try saying: I want to accept rebar on Building 1, Floor 6.
ar: عذرًا، لم أفهم. جرّب قول: أريد قبول حديد التسليح في المبنى 1، الطابق 6.
zh: 暂时无法理解您的指令，请尝试说：我要验收1栋6层的钢筋。
zh_hant: 暫時無法理解您的指令，請嘗試說：我要驗收1棟6層的鋼筋。

# homeStatusIntentUnrecognizedRetry
source: Intent not recognized. Please try again
ar: تعذر التعرف على النية. حاول مرة أخرى
zh: 意图无法识别，请重试
zh_hant: 意圖無法辨識，請重試

# homeTooltipProjectDashboard
source: Project dashboard
ar: لوحة المشروع
zh: 项目驾驶舱
zh_hant: 專案儀表板

# homeLabelAiChat
source: AI Chat
ar: محادثة AI
zh: AI问答
zh_hant: AI問答

# homeToggleOfflineSpeech
source: Enable offline speech recognition
ar: تمكين التعرف على الكلام دون اتصال
zh: 启用离线语音识别
zh_hant: 啟用離線語音辨識

# homeStatusOfflineSpeechEnabled
source: Offline speech recognition enabled
ar: تم تمكين التعرف على الكلام دون اتصال
zh: 离线语音识别已开启
zh_hant: 離線語音辨識已開啟

# homeStatusOfflineSpeechDisabled
source: Offline speech recognition disabled (using Xunfei online)
ar: تم تعطيل التعرف دون اتصال (استخدام Xunfei عبر الإنترنت)
zh: 离线语音识别已关闭（使用讯飞在线）
zh_hant: 離線語音辨識已關閉（使用訊飛線上）

# homeToggleOfflineGemmaMultimodal
source: Enable offline Gemma multimodal (image recognition)
zh: 启用离线Gemma多模态（图片识别）
zh_hant: 啟用離線Gemma多模態（圖片辨識）

# homeStatusPreparingGemmaMultimodal
source: Preparing Gemma multimodal model…
zh: 正在准备Gemma多模态模型…
zh_hant: 正在準備Gemma多模態模型…

# homeStatusGemmaMultimodalEnabled
source: Gemma multimodal enabled
zh: Gemma多模态已启用
zh_hant: Gemma多模態已啟用

# homeSnackGemmaMultimodalEnableFailed
source: Failed to enable Gemma multimodal: {error} Tip: This HuggingFace model is gated. You need to accept the license and provide a token (--dart-define=HUGGINGFACE_TOKEN=... or lib/app_local_secrets.dart:kHuggingfaceToken).
zh: Gemma多模态启用失败：{error} 提示：该模型在 HuggingFace 为受限仓库，需要先同意许可并提供 token（--dart-define=HUGGINGFACE_TOKEN=... 或 lib/app_local_secrets.dart:kHuggingfaceToken）。
zh_hant: Gemma多模態啟用失敗：{error} 提示：該模型在 HuggingFace 為受限倉庫，需要先同意授權並提供 token（--dart-define=HUGGINGFACE_TOKEN=... 或 lib/app_local_secrets.dart:kHuggingfaceToken）。

# homeStatusGemmaMultimodalEnableFailedFallback
source: Multimodal failed; falling back to rule-based parsing
zh: 多模态启用失败，已回退规则解析
zh_hant: 多模態啟用失敗，已回退規則解析

# homeStatusGemmaMultimodalDisabled
source: Multimodal disabled
zh: 多模态已关闭
zh_hant: 多模態已關閉

# homeButtonProcedureAcceptance
source: Procedure acceptance
ar: قبول الإجراء
zh: 工序验收
zh_hant: 工序驗收

# homeButtonDailyInspection
source: Daily inspection
ar: تفتيش يومي
zh: 日常巡检
zh_hant: 日常巡檢

# homeButtonSupervisionCheck
source: Supervision check
ar: فحص إشرافي
zh: 监督检查
zh_hant: 監督檢查

# homeButtonPanoramaInspection
source: Panorama inspection
ar: تفتيش بانورامي
zh: 全景巡检
zh_hant: 全景巡檢

# homeSectionExampleCommands
source: Example commands
ar: أوامر نموذجية
zh: 示例指令
zh_hant: 範例指令

# homeExampleCommands
source: I want to run procedure acceptance for rebar on Building 1, Floor 6 Report an issue Building 3, Floor 4: rebar cover is insufficient
ar: أريد تنفيذ قبول الإجراء لحديد التسليح في المبنى 1، الطابق 6 الإبلاغ عن مشكلة المبنى 3، الطابق 4: غطاء التسليح غير كافٍ
zh: 我要验收1栋6层的钢筋 发现问题 3栋4层发现钢筋保护层不足
zh_hant: 我要驗收1棟6層的鋼筋 發現問題 3棟4層發現鋼筋保護層不足

# homeSectionCurrentStatus
source: Current status
ar: الحالة الحالية
zh: 当前状态
zh_hant: 目前狀態

# homeRealtimeRecognition
source: Live: {partial}
ar: مباشر: {partial}
zh: 实时识别：{partial}
zh_hant: 即時辨識：{partial}

# homeLastRecognition
source: Last: {text}
ar: آخر: {text}
zh: 上次识别：{text}
zh_hant: 上次辨識：{text}

# homeSnackLongPressMicHint
source: Long-press the mic to speak, release to finish
ar: اضغط مطولاً على الميكروفون للتحدث ثم اتركه للإنهاء
zh: 请长按麦克风开始说话，松开结束
zh_hant: 請長按麥克風開始說話，放開結束

# issueStatusOpen
source: Open
ar: مفتوح
zh: 未闭环
zh_hant: 未閉環

# issueStatusClosed
source: Closed
ar: مغلق
zh: 已闭环
zh_hant: 已閉環

# acceptanceResultQualified
source: Qualified
ar: مقبول
zh: 合格
zh_hant: 合格

# acceptanceResultUnqualified
source: Unqualified
ar: غير مقبول
zh: 不合格
zh_hant: 不合格

# acceptanceResultPending
source: Pending
ar: معلّق
zh: 甩项
zh_hant: 甩項

# dashboardTitle
source: Project Dashboard
ar: لوحة المشروع
zh: 项目驾驶舱
zh_hant: 專案儀表板

# dashboardSectionQualityOverview
source: Quality overview
ar: نظرة عامة على الجودة
zh: 质量概览
zh_hant: 品質概覽

# dashboardKpiAcceptanceItems
source: Acceptance items
ar: عناصر القبول
zh: 验收分项
zh_hant: 驗收分項

# dashboardKpiInspectionIssues
source: Inspection issues
ar: مشكلات التفتيش
zh: 巡检问题
zh_hant: 巡檢問題

# dashboardKpiAcceptanceUnqualified
source: Acceptance unqualified
ar: قبول غير مطابق
zh: 验收不合格
zh_hant: 驗收不合格

# dashboardKpiInspectionOpen
source: Open inspection issues
ar: مشكلات التفتيش المفتوحة
zh: 巡检未闭环
zh_hant: 巡檢未閉環

# dashboardSubtitleAcceptanceQualifiedPending
source: Qualified {qualified} / Pending {pending}
ar: مطابق {qualified} / معلّق {pending}
zh: 合格{qualified} / 甩项{pending}
zh_hant: 合格{qualified} / 甩項{pending}

# dashboardSubtitleInspectionClosed
source: Closed {closed}
ar: مغلق {closed}
zh: 已闭环{closed}
zh_hant: 已閉環{closed}

# dashboardSectionTopResponsibleUnits
source: Top responsible units (open)
ar: أهم الوحدات المسؤولة (مفتوح)
zh: 未闭环责任单位 Top
zh_hant: 未閉環責任單位 Top

# dashboardNoData
source: No data
ar: لا توجد بيانات
zh: 暂无数据
zh_hant: 暫無資料

# dashboardUnfilled
source: Not set
ar: غير محدد
zh: 未填写
zh_hant: 未填寫

# dashboardCountRows
source: {count}
zh: {count} 条
zh_hant: {count} 條

# dashboardSectionFocusPack
source: Recent focus (Focus Pack)
ar: التركيز الأخير (Focus Pack)
zh: 近期关注（Focus Pack）
zh_hant: 近期關注（Focus Pack）

# dashboardTimeWindow
source: Window: last {days} days ({start} ~ {end})
ar: الفترة: آخر {days} يومًا ({start} ~ {end})
zh: 时间窗：近{days}天（{start} ~ {end}）
zh_hant: 時間窗：近{days}天（{start} ~ {end}）

# dashboardTimeWindowDefault
source: Window: last 14 days
ar: الفترة: آخر 14 يومًا
zh: 时间窗：近14天
zh_hant: 時間窗：近14天

# dashboardKpiAcceptanceUnqualifiedItems
source: Unqualified acceptance items
ar: عناصر قبول غير مطابقة
zh: 验收不合格分项
zh_hant: 驗收不合格分項

# dashboardSubtitleAcceptancePending
source: Pending {pending}
ar: معلّق {pending}
zh: 甩项{pending}
zh_hant: 甩項{pending}

# dashboardSubtitleInspectionSevereOverdue
source: Severe {severe} / Overdue {overdue}
ar: شديد {severe} / متأخر {overdue}
zh: 严重{severe} / 逾期{overdue}
zh_hant: 嚴重{severe} / 逾期{overdue}

# dashboardSectionTopFocus
source: Top focus
ar: أهم نقاط التركيز
zh: Top关注点
zh_hant: Top關注點

# dashboardTopFocusNoEnoughData
source: Not enough data to generate focus
ar: لا توجد بيانات كافية لإنشاء نقاط التركيز
zh: 暂无足够数据生成关注点
zh_hant: 暫無足夠資料生成關注點

# dashboardTopFocusDefaultTitle
source: Focus
ar: نقطة تركيز
zh: 关注点
zh_hant: 關注點

# dashboardScope
source: Scope: {building}
ar: النطاق: {building}
zh: 范围：{building}
zh_hant: 範圍：{building}

# dashboardRiskScore
source: Risk {score}
ar: مخاطر {score}
zh: 风险{score}
zh_hant: 風險{score}

# dashboardSectionClosureEfficiency
source: Closure efficiency
ar: كفاءة الإغلاق
zh: 闭环效率
zh_hant: 閉環效率

# dashboardIssueCloseDurationTitle
source: Inspection close duration
ar: مدة إغلاق التفتيش
zh: 巡检关闭时长
zh_hant: 巡檢關閉時長

# dashboardAcceptanceVerifyDurationTitle
source: Acceptance recheck duration
ar: مدة إعادة التحقق للقبول
zh: 验收复验时长
zh_hant: 驗收複驗時長

# dashboardDurationStats
source: Avg {avg} d / Median {median} d ({count} times)
ar: المتوسط {avg} يوم / الوسيط {median} يوم ({count} مرة)
zh: 均值 {avg} 天 / 中位数 {median} 天（{count} 次）
zh_hant: 均值 {avg} 天 / 中位數 {median} 天（{count} 次）

# dashboardSectionDataQuality
source: Data quality
ar: جودة البيانات
zh: 数据质量
zh_hant: 資料品質

# dashboardMissingBuildingTitle
source: Missing building field
ar: حقل building مفقود
zh: 未解析部位（building）
zh_hant: 未解析部位（building）

# dashboardMissingBuildingStats
source: Acceptance {acceptance} / Issues {issues}
ar: القبول {acceptance} / المشكلات {issues}
zh: 验收 {acceptance} 条 / 巡检 {issues} 条
zh_hant: 驗收 {acceptance} 條 / 巡檢 {issues} 條

# dashboardMissingClosureActionsTitle
source: Missing closure actions
ar: إجراءات الإغلاق مفقودة
zh: 闭环动作缺失
zh_hant: 閉環動作缺失

# dashboardMissingClosureActionsStats
source: Closed issues without close action {issuesClosedMissingClose}; acceptance missing verify action {acceptanceMissingVerify}
ar: مشكلات مغلقة بدون إجراء close: {issuesClosedMissingClose}؛ قبول بدون إجراء verify: {acceptanceMissingVerify}
zh: 已关闭巡检但无 close 动作 {issuesClosedMissingClose} 条；验收缺 verify 动作 {acceptanceMissingVerify} 条
zh_hant: 已關閉巡檢但無 close 動作 {issuesClosedMissingClose} 條；驗收缺 verify 動作 {acceptanceMissingVerify} 條

# dashboardSectionBuildingRisk
source: Building risk distribution
ar: توزيع مخاطر المباني
zh: 楼栋风险分布
zh_hant: 樓棟風險分佈

# dashboardNoBuildingData
source: No building data
ar: لا توجد بيانات للمباني
zh: 暂无楼栋数据
zh_hant: 暫無樓棟資料

# dashboardUnparsed
source: Unparsed
ar: غير مُحلّل
zh: 未解析
zh_hant: 未解析

# recordsEmptyAcceptance
source: No acceptance records
ar: لا توجد سجلات قبول
zh: 暂无验收记录
zh_hant: 暫無驗收記錄

# recordsEmptyIssue
source: No inspection issues
ar: لا توجد مشكلات تفتيش
zh: 暂无巡检问题
zh_hant: 暫無巡檢問題

# recordsUnnamedAcceptance
source: (Untitled acceptance record)
ar: (سجل قبول بدون عنوان)
zh: （未命名验收记录）
zh_hant: （未命名驗收記錄）

# recordsUnnamedIssue
source: (Untitled inspection record)
ar: (سجل تفتيش بدون عنوان)
zh: （未命名巡检记录）
zh_hant: （未命名巡檢記錄）

# recordsSubtitleResult
source: Result: {result}
ar: النتيجة: {result}
zh: 结果：{result}
zh_hant: 結果：{result}

# recordsSubtitleAcceptanceIndicators
source: Indicators: Q{qualified}/U{unqualified}/P{pending}
ar: المؤشرات: مطابق {qualified} / غير مطابق {unqualified} / معلّق {pending}
zh: 指标：合格{qualified}/不合格{unqualified}/甩项{pending}
zh_hant: 指標：合格{qualified}/不合格{unqualified}/甩項{pending}

# recordsSubtitleTime
source: Time: {time}
ar: الوقت: {time}
zh: 时间：{time}
zh_hant: 時間：{time}

# recordsSubtitleSeverity
source: Severity: {severity}
ar: الشدة: {severity}
zh: 严重性：{severity}
zh_hant: 嚴重性：{severity}

# acceptanceRecordDetailTitle
source: Acceptance record details
ar: تفاصيل سجل القبول
zh: 验收记录详情
zh_hant: 驗收記錄詳情

# issueRecordDetailTitle
source: Inspection record details
ar: تفاصيل سجل التفتيش
zh: 巡检记录详情
zh_hant: 巡檢記錄詳情

# recordsFieldBuilding
source: Building
ar: المبنى
zh: 栋
zh_hant: 棟

# recordsFieldFloor
source: Floor
ar: الطابق
zh: 层
zh_hant: 層

# recordsFieldZone
source: Zone
ar: المنطقة
zh: 区
zh_hant: 區

# recordsFieldLibraryId
source: Library ID
ar: معرّف المكتبة
zh: 问题库ID
zh_hant: 問題庫ID

# recordsFieldProcedure
source: Procedure
ar: الإجراء
zh: 工序
zh_hant: 工序

# recordsFieldDescription
source: Description
ar: الوصف
zh: 描述
zh_hant: 描述

# recordsFieldSeverity
source: Severity
ar: الشدة
zh: 严重性
zh_hant: 嚴重性

# recordsFieldDeadlineDays
source: Deadline (days)
ar: المهلة (أيام)
zh: 整改期限(天)
zh_hant: 整改期限(天)

# recordsFieldResponsibleUnit
source: Responsible unit
ar: الوحدة المسؤولة
zh: 责任单位
zh_hant: 責任單位

# recordsFieldResponsiblePerson
source: Responsible person
ar: المسؤول
zh: 责任人
zh_hant: 責任人

# recordsFieldStatus
source: Status
ar: الحالة
zh: 状态
zh_hant: 狀態

# recordsFieldOverallResult
source: Overall result
ar: النتيجة الإجمالية
zh: 综合结果
zh_hant: 綜合結果

# recordsFieldTime
source: Time
ar: الوقت
zh: 时间
zh_hant: 時間

# recordsFieldClientRecordId
source: Idempotency ID
ar: معرّف التكرار
zh: 幂等ID
zh_hant: 冪等ID

# recordsSectionIndicators
source: Indicator details
ar: تفاصيل المؤشرات
zh: 指标明细
zh_hant: 指標明細

# recordsUnnamedIndicator
source: (Untitled indicator)
ar: (مؤشر بدون اسم)
zh: （未命名指标）
zh_hant: （未命名指標）

# recordsSectionPhotoPreview
source: Photo preview
ar: معاينة الصورة
zh: 照片预览
zh_hant: 照片預覽

# recordsRectificationTitleAcceptance
source: Rectification (Acceptance #{id})
ar: إجراءات المعالجة (قبول #{id})
zh: 整改闭环（验收记录 #{id}）
zh_hant: 整改閉環（驗收記錄 #{id}）

# recordsRectificationTitleIssue
source: Rectification (Issue #{id})
ar: إجراءات المعالجة (مشكلة #{id})
zh: 整改闭环（巡检问题 #{id}）
zh_hant: 整改閉環（巡檢問題 #{id}）

# recordsRectificationActionVerify
source: Rectify / Verify
ar: معالجة / تحقق
zh: 整改/复验
zh_hant: 整改/複驗

# recordsRectificationActionView
source: View rectification
ar: عرض المعالجة
zh: 查看整改闭环
zh_hant: 查看整改閉環

# recordsRectificationActionSubmitAndClose
source: Rectification (submit / verify / close)
ar: المعالجة (إرسال / تحقق / إغلاق)
zh: 整改闭环（提交整改/复验关闭）
zh_hant: 整改閉環（提交整改/複驗關閉）

# recordsRemark
source: Remark: {text}
ar: ملاحظة: {text}
zh: 备注：{text}
zh_hant: 備註：{text}

# recordsClientRecordId
source: Idempotency ID: {id}
ar: معرّف التكرار: {id}
zh: 幂等ID：{id}
zh_hant: 冪等ID：{id}

# commonClose
source: Close
ar: إغلاق
zh: 关闭
zh_hant: 關閉

# commonBack
source: Back
ar: رجوع
zh: 返回
zh_hant: 返回

# commonBackHome
source: Back to Home
ar: العودة إلى الرئيسية
zh: 返回首页
zh_hant: 返回首頁

# commonRetry
source: Retry
ar: إعادة المحاولة
zh: 重试
zh_hant: 重試

# commonSave
source: Save
ar: حفظ
zh: 保存
zh_hant: 儲存

# commonSaveDraft
source: Save draft
ar: حفظ كمسودة
zh: 暂存
zh_hant: 暫存

# commonSubmit
source: Submit
ar: إرسال
zh: 提交
zh_hant: 提交

# commonSubmitting
source: Submitting…
ar: جارٍ الإرسال…
zh: 提交中…
zh_hant: 提交中…

# commonViewRecords
source: View records
ar: عرض السجلات
zh: 查看记录表
zh_hant: 查看記錄表

# commonPleaseSelect
source: Please select
ar: يرجى الاختيار
zh: 请选择
zh_hant: 請選擇

# commonPleaseInput
source: Please input
ar: يرجى الإدخال
zh: 请输入
zh_hant: 請輸入

# commonSpeechInitFailed
source: Failed to initialize speech recognition
ar: فشل تهيئة التعرف على الكلام
zh: 语音识别初始化失败
zh_hant: 語音辨識初始化失敗

# commonTtsEnteringIssueReport
source: Issue reporting intent detected. Opening the issue report page.
ar: تم اكتشاف نية الإبلاغ عن مشكلة. جارٍ فتح صفحة الإبلاغ.
zh: 检测到问题上报意图，进入问题上报页面。
zh_hant: 偵測到問題上報意圖，進入問題上報頁面。

# commonPhotoSaved
source: Photo saved
ar: تم حفظ الصورة
zh: 照片已保存
zh_hant: 照片已儲存

# commonSnackSavedLocally
source: Saved locally
ar: تم الحفظ محليًا
zh: 已暂存到本地
zh_hant: 已暫存到本機

# commonSnackSavedLocallyMock
source: Saved locally (demo)
ar: تم الحفظ محليًا (نسخة تجريبية)
zh: 已暂存到本地（演示）
zh_hant: 已暫存到本機（示範）

# commonTtsSavedLocally
source: Saved locally. You can sync later.
ar: تم الحفظ محليًا. يمكنك المزامنة لاحقًا.
zh: 已暂存到本地，稍后可同步。
zh_hant: 已暫存到本機，稍後可同步。

# commonSnackLongPressMicHint
source: Long-press the mic to speak, release to finish
ar: اضغط مطولاً على الميكروفون للتحدث ثم اتركه للإنهاء
zh: 请长按麦克风开始说话，松开结束
zh_hant: 請長按麥克風開始說話，放開結束

# aiChatTitle
source: AI Chat
ar: سؤال وجواب بالذكاء الاصطناعي
zh: AI问答
zh_hant: AI問答

# aiChatSeedMessage
source: You can ask freely: - How is the project progressing? Summarize by building and explain why - Why are so many inspections not closed-loop? Where are the risks? - Give rectification priorities and next-step suggestions (I will answer based on accepted/inspection facts stored in the database)
ar: يمكنك أن تسأل بحرية: - كيف تسير تقدمات المشروع؟ لخّص حسب المباني واشرح الأسباب - لماذا هناك الكثير من التفتيشات غير المغلقة؟ أين نقاط المخاطر؟ - قدّم أولويات المعالجة واقتراحات الخطوة التالية (سأجيب بناءً على حقائق القبول/التفتيش المخزنة في قاعدة البيانات)
zh: 你可以自由问： - 项目进展如何？按楼栋总结并解释原因 - 为什么巡检未闭环多？风险点在哪里 - 给出整改优先级和下一步建议 （我会基于已落库的验收/巡检事实回答）
zh_hant: 你可以自由問： - 專案進展如何？按樓棟總結並解釋原因 - 為什麼巡檢未閉環多？風險點在哪裡 - 給出整改優先級和下一步建議 （我會基於已落庫的驗收/巡檢事實回答）

# aiChatTooltipHistory
source: Sessions
ar: الجلسات
zh: 历史会话
zh_hant: 歷史會話

# aiChatTooltipNewSession
source: New session
ar: جلسة جديدة
zh: 新会话
zh_hant: 新會話

# aiChatNewSessionTitle
source: New session
ar: جلسة جديدة
zh: 新会话
zh_hant: 新會話

# aiChatUntitledSession
source: Untitled session
ar: جلسة بدون عنوان
zh: 未命名会话
zh_hant: 未命名會話

# aiChatEditAndResend
source: Edit and resend
ar: تعديل وإعادة الإرسال
zh: 编辑并重新发送
zh_hant: 編輯並重新傳送

# aiChatHintListening
source: Listening…
ar: جارٍ الاستماع…
zh: 正在聆听…
zh_hant: 正在聆聽…

# aiChatHintAskQuestion
source: Type a question…
ar: اكتب سؤالاً…
zh: 输入问题…
zh_hant: 輸入問題…

# aiChatSend
source: Send
ar: إرسال
zh: 发送
zh_hant: 傳送

# aiChatSending
source: Sending…
ar: جارٍ الإرسال…
zh: 发送中…
zh_hant: 傳送中…

# aiChatEmptyResponse
source: (Empty response)
ar: (استجابة فارغة)
zh: （空响应）
zh_hant: （空回應）

# aiChatRequestFailed
source: Request failed: {error}
ar: فشل الطلب: {error}
zh: 请求失败：{error}
zh_hant: 請求失敗：{error}

# aiChatSessionsTitle
source: Sessions
ar: الجلسات
zh: 历史会话
zh_hant: 歷史會話

# aiChatSessionsEmpty
source: No sessions yet
ar: لا توجد جلسات بعد
zh: 暂无历史会话
zh_hant: 暫無歷史會話

# aiChatDeleteSessionTitle
source: Delete session?
ar: حذف الجلسة؟
zh: 删除会话？
zh_hant: 刪除會話？

# aiChatDeleteSessionBody
source: This cannot be undone.
ar: لا يمكن التراجع عن ذلك.
zh: 删除后无法恢复。
zh_hant: 刪除後無法復原。

# aiChatModelStatusTitle
source: LLM status
ar: حالة النموذج
zh: 大模型状态
zh_hant: 大模型狀態

# aiChatGetModelStatusFailed
source: Failed to fetch LLM status: {error}
ar: فشل جلب حالة النموذج: {error}
zh: 获取大模型状态失败：{error}
zh_hant: 取得大模型狀態失敗：{error}

# aiChatTooltipModelStatus
source: LLM status
ar: حالة النموذج
zh: 大模型状态
zh_hant: 大模型狀態
